СМП_ОнлайнОбменДанными/cfe/src/DataProcessors/АвтонастройкаПравилКонвертацииЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АвтонастройкаПравилКонвертацииЗначений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПравилоКО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаРезультат</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/DataProcessors/АвтонастройкаПравилКонвертацииЗначений/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПравилоКО", Объект.ПравилоКО);
	
	Если Объект.ПравилоКО.Пустая() Тогда
		ОбщегоНазначения.СообщитьПользователю("Обработка предназначена для открытия с формы элемента учетной записи обмена.",,,, Отказ);
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если ОбработкаОбъект.ВыполнитьСинхронизацию() Тогда
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьСвойстваКнопкиКомандыОтображенияДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаРезультат
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	МассивСтрок = Объект.ТаблицаРезультат.НайтиСтроки(Новый Структура("Пометка, Сопоставлены", Ложь, Ложь));
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		СтрокаТЧ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	МассивСтрок = Объект.ТаблицаРезультат.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		СтрокаТЧ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьВсеДанные(Команда)
	
	Объект.ОтображатьВсеДанные = НЕ Объект.ОтображатьВсеДанные;
	УстановитьСвойстваКнопкиКомандыОтображенияДанных();
	//ОбновитьДанныеОСинхронизацииЗначений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПКЗ(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьСвойстваКнопкиКомандыОтображенияДанных() 
	
	Элементы.ФормаОтображатьВсеДанные.Заголовок = ?(Объект.ОтображатьВсеДанные, "Не сопоставленные", "Все");
	//Элементы.ФормаОтображатьВсеДанные.Пометка = НЕ Объект.ОтображатьВсеДанные;
	Элементы.ТаблицаРезультат.ОтборСтрок = ?(Объект.ОтображатьВсеДанные, 
	Неопределено, 
	Новый ФиксированнаяСтруктура(Новый Структура("Сопоставлены", Ложь)));
	
КонецПроцедуры //УстановитьЗаголовокКомандыОтображенияДанных

#КонецОбласти
